garyPenhook/PyAvrOCD/svd/attiny24.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EEPROM</name>
      <description>EEPROM</description>
      <baseAddress>0x0080003C</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EEAR</name>
          <description>EEPROM Address Register  Bytes</description>
          <addressOffset>0x2</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>EECR</name>
          <description>EEPROM Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EERE</name>
              <description>EEPROM Read Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEPE</name>
              <description>EEPROM Write Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEMPE</name>
              <description>EEPROM Master Write Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EERIE</name>
              <description>EEPROM Ready Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEPM</name>
              <description>EEPROM Programming Mode Bits</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERASE_AND_WRITE_IN_ONE_OPERATION</name>
                  <description>Erase and Write in one operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASE_ONLY</name>
                  <description>Erase Only</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_ONLY</name>
                  <description>Write Only</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EEDR</name>
          <description>EEPROM Data Register</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>EXINT</name>
      <description>External Interrupts</description>
      <baseAddress>0x00800032</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xE</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x23</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GIFR</name>
          <description>General Interrupt Flag register (read-only for debugger)</description>
          <addressOffset>0x28</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PCIF</name>
              <description>Pin Change Interrupt Flags</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTF0</name>
              <description>External Interrupt Flag 0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GIMSK</name>
          <description>General Interrupt Mask Register</description>
          <addressOffset>0x29</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PCIE</name>
              <description>Pin Change Interrupt Enables</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT0</name>
              <description>External Interrupt Request 0 Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCUCR</name>
          <description>MCU Control Register</description>
          <addressOffset>0x23</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISC00</name>
              <description>Interrupt Sense Control 0 Bit 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_LEVEL_OF_INTX</name>
                  <description>Low Level of INTX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_LOGICAL_CHANGE_OF_INTX</name>
                  <description>Any Logical Change of INTX</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISC01</name>
              <description>Interrupt Sense Control 0 Bit 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCMSK0</name>
          <description>Pin Change Enable Mask 0</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>PCMSK1</name>
          <description>Pin Change Enable Mask 1</description>
          <addressOffset>0xE</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
